ocs-get-balance.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices"
                  xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon"
                  xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
    <soapenv:Header/>
    <soapenv:Body>
        <ars:QueryBalanceRequestMsg>
            <RequestHeader>
                <cbs:Version>1</cbs:Version>
                <cbs:BusinessCode>1</cbs:BusinessCode><cbs:MessageSeq>1</cbs:MessageSeq>
                <cbs:OwnershipInfo>
                    <cbs:BEID>101</cbs:BEID>
                </cbs:OwnershipInfo>
                <cbs:AccessSecurity>
                    <cbs:LoginSystemCode>%s</cbs:LoginSystemCode>
                    <cbs:Password>%s</cbs:Password>
                </cbs:AccessSecurity>
                <cbs:OperatorInfo>
                    <cbs:OperatorID>%s</cbs:OperatorID>
                </cbs:OperatorInfo>
            </RequestHeader>
            <QueryBalanceRequest>
                <ars:QueryObj>
                    <ars:SubAccessCode>
                        <arc:SubscriberKey>%s</arc:SubscriberKey>
                    </ars:SubAccessCode>
                </ars:QueryObj>
                <ars:BalanceType/>
            </QueryBalanceRequest>
        </ars:QueryBalanceRequestMsg>
    </soapenv:Body>
</soapenv:Envelope>
